In [2]:
import pandas as pd
import numpy as np

data = pd.read_csv('/Users/samy/Downloads/CSV-15/Python 3 CSV/MSFT_AAPL_2000_2017.csv', index_col='Date')
data

                 MSFT        AAPL
Date
1999-12-31  38.965767    3.303425
2000-01-03  38.903194    3.596616
2000-01-04  37.589046    3.293384
2000-01-05  37.985374    3.341579
2000-01-06  36.712940    3.052405
...               ...         ...
2017-03-17  64.158463  138.869217
2017-03-20  64.217804  140.327454
2017-03-21  63.505699  138.720413
2017-03-22  64.316704  140.287766
2017-03-23  64.158463  139.791763

[4334 rows x 2 columns]

In [4]:
log_return = np.log(data/data.shift(1))
log_return

                MSFT      AAPL
Date
1999-12-31       NaN       NaN
2000-01-03 -0.001607  0.085034
2000-01-04 -0.034364 -0.088078
2000-01-05  0.010489  0.014528
2000-01-06 -0.034072 -0.090514
...              ...       ...
2017-03-17  0.003552 -0.004988
2017-03-20  0.000924  0.010446
2017-03-21 -0.011151 -0.011518
2017-03-22  0.012690  0.011235
2017-03-23 -0.002463 -0.003542

[4334 rows x 2 columns]

In [6]:
daily_risk_msft = log_return['MSFT'].std()
annual_risk_msft = log_return['MSFT'].std()* 250 ** 0.5

daily_risk_msft, annual_risk_msft

(0.019656948849403593, 0.3108036510677075)

In [8]:
daily_risk_aapl = log_return['AAPL'].std()
annual_risk_aapl = log_return['AAPL'].std()* 250 ** 0.5

daily_risk_aapl, annual_risk_aapl

(0.027761934312069397, 0.43895472339059527)

In [10]:
vols = log_return[['MSFT','AAPL']].std()*250**0.5
vols

MSFT    0.310804
AAPL    0.438955
dtype: float64

In [33]:
# calculating the covariance and correlation between Walmart and Facebook

data_2 = pd.read_csv('/Users/samy/Downloads/CSV-23/Python 3 CSV/Walmart_FB_2014_2017.csv', index_col='Date')
data_2

                  WMT          FB
Date
2013-12-31  71.126411   54.650002
2014-01-02  71.325287   54.709999
2014-01-03  71.090279   54.560001
2014-01-06  70.692558   57.200001
2014-01-07  70.909485   57.919998
...               ...         ...
2017-04-03  70.906502  142.279999
2017-04-04  71.084190  141.729996
2017-04-05  70.728821  141.850006
2017-04-06  70.511650  141.169998
2017-04-07  71.962746  140.779999

[824 rows x 2 columns]

In [35]:
log_return_2 = np.log(data_2/data_2.shift(1))
log_return_2

                 WMT        FB
Date
2013-12-31       NaN       NaN
2014-01-02  0.002792  0.001097
2014-01-03 -0.003300 -0.002745
2014-01-06 -0.005610  0.047253
2014-01-07  0.003064  0.012509
...              ...       ...
2017-04-03 -0.003474  0.001618
2017-04-04  0.002503 -0.003873
2017-04-05 -0.005012  0.000846
2017-04-06 -0.003075 -0.004805
2017-04-07  0.020371 -0.002766

[824 rows x 2 columns]

In [41]:
# calculating average annual return for both stocks
avg_return = log_return_2[['WMT','FB']].mean() * 250
avg_return

WMT    0.003551
FB     0.287439
dtype: float64

In [45]:
std = log_return_2[['WMT','FB']].std() * 250 ** 0.5
std

WMT    0.177607
FB     0.287726
dtype: float64

In [49]:
# covariance matrix of the two stocks

cov_matrix = log_return_2[['WMT','FB']].cov() 
cov_matrix

          WMT        FB
WMT  0.000126  0.000035
FB   0.000035  0.000331

In [51]:
cov_matrix_annually = log_return_2[['WMT','FB']].cov() * 250
cov_matrix_annually

          WMT        FB
WMT  0.031544  0.008777
FB   0.008777  0.082786

In [53]:
# correlation

corr_matrix = log_return_2.corr()
corr_matrix

          WMT        FB
WMT  1.000000  0.171746
FB   0.171746  1.000000

In [57]:
# calculating an equally weighted portfolio's variance and volatility 

data_3 = pd.read_csv('/Users/samy/Downloads/CSV-24/Python 3 CSV/MSFT_AAPL_2000_2017.csv', index_col='Date')
data_3

                 MSFT        AAPL
Date
1999-12-31  38.965767    3.303425
2000-01-03  38.903194    3.596616
2000-01-04  37.589046    3.293384
2000-01-05  37.985374    3.341579
2000-01-06  36.712940    3.052405
...               ...         ...
2017-03-17  64.158463  138.869217
2017-03-20  64.217804  140.327454
2017-03-21  63.505699  138.720413
2017-03-22  64.316704  140.287766
2017-03-23  64.158463  139.791763

[4334 rows x 2 columns]

In [91]:
weights = np.array([0.5, 0.5])

portfolio_var = np.dot(weights.T, (np.dot(log_return.cov() * 250, weights)))
portfolio_var

0.09961622870546066

In [79]:
portfolio_vol = str(round(portfolio_var ** 0.5 * 100,4)) + '%'
portfolio_vol

'31.562%'

In [101]:
# calculating the annual systematic and idiosyncratic risk of the portfolio

diversifiable_risk = portfolio_var - (weights[0] ** 2 * log_return['MSFT'].var() * 250) - (weights[1] ** 2 * log_return['AAPL'].var() * 250)
diversifiable_risk

0.02729618902947783

In [103]:
non_diversifiable_risk = portfolio_var - diversifiable_risk
non_diversifiable_risk

0.07232003967598283

In [105]:
# With weights 0.2 for Microsoft and 0.8 for Apple

weights_2 = np.array([0.2,0.8])
weights_2

array([0.2, 0.8])

In [111]:
portfolio_var_2 = np.dot(weights_2.T, (np.dot(log_return.cov() * 250, weights_2)))
portfolio_var_2

0.14464951683917135

In [125]:
div_risk_2 = portfolio_var_2 - (weights_2[0] ** 2 * log_return['MSFT'].var() * 250) - (weights_2[1] ** 2 * log_return['AAPL'].var() * 250)
div_risk_2

0.017469560978865678

In [127]:
non_div_risk_2 = portfolio_var_2 - div_risk_2
non_div_risk_2

0.12717995586030567